spec/fixtures/services/targeting_idea_service/get-req.xml

<?xml version='1.0' encoding='UTF-8'?> 
<env:Envelope xmlns:xsd='http://www.w3.org/2001/XMLSchema' 
              xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
              xmlns:env='http://schemas.xmlsoap.org/soap/envelope/'
              xmlns='https://adwords.google.com/api/adwords/cm/v200909'
              xmlns:s='https://adwords.google.com/api/adwords/o/v200909'>
  <env:Header>
    <s:RequestHeader env:mustUnderstand='0'>
      <authToken>***censured***</authToken>
      <userAgent>
        Sem4r Adwords Ruby Client Library (http://github.com/sem4r/sem4r)
      </userAgent>
      <developerToken>***censured***</developerToken>
    </s:RequestHeader>
  </env:Header>
  <env:Body>

    <s:get>
      <s:selector>

        <s:ideaType>KEYWORD</s:ideaType>
        <s:requestType>IDEAS</s:requestType>

        <s:searchParameters xsi:type='s:ExcludedKeywordSearchParameter'>
          <s:keywords xsi:type='Keyword'>
            <Criterion.Type>Keyword</Criterion.Type>
            <text>media player</text>
            <matchType>EXACT</matchType>
          </s:keywords>
        </s:searchParameters>

        <s:searchParameters xsi:type='s:KeywordMatchTypeSearchParameter'>
          <s:keywordMatchTypes>BROAD</s:keywordMatchTypes>
          <s:keywordMatchTypes>EXACT</s:keywordMatchTypes>
        </s:searchParameters>

        <s:searchParameters xsi:type='s:RelatedToKeywordSearchParameter'>
          <s:keywords xsi:type='Keyword'>
            <Criterion.Type>Keyword</Criterion.Type>
            <text>dvd player</text>
            <matchType>EXACT</matchType>
          </s:keywords>
        </s:searchParameters>

        <s:paging>
          <startIndex>0</startIndex>
          <numberResults>100</numberResults>
        </s:paging>

      </s:selector>
    </s:get>

  </env:Body>
</env:Envelope>


